# Filtrando valores

In [1]:
import pandas as pd

In [2]:
# Criando um dataset de exemplo
df = pd.DataFrame({'Nome': ['Dayana', 'Camila', 'Felipe', 'Dayana', 'Jander', \
                            'Paulo', 'Jander', 'Marcos', 'Oswaldo', 'Gabriela'],
                   'Cidade': ['Mogi-Mirim', 'Campinas', 'São Paulo', 'Campinas', 'Mogi-Mirim', \
                              'Campinas', 'Goiânia', 'Itapira', 'Limeira', 'Mogi-Mirim']})

In [3]:
df[(df['Nome'] == 'Jander') | (df['Nome'] == 'Dayana')]

     Nome      Cidade
0  Dayana  Mogi-Mirim
3  Dayana    Campinas
4  Jander  Mogi-Mirim
6  Jander     Goiânia

In [4]:
df[(df['Nome'] == 'Jander') & (df['Cidade'] == 'Mogi-Mirim')]

     Nome      Cidade
4  Jander  Mogi-Mirim

In [5]:
df[df['Cidade'].isin(['Mogi-Mirim', 'Campinas'])]

       Nome      Cidade
0    Dayana  Mogi-Mirim
1    Camila    Campinas
3    Dayana    Campinas
4    Jander  Mogi-Mirim
5     Paulo    Campinas
9  Gabriela  Mogi-Mirim

In [6]:
df[~df['Cidade'].isin(['Mogi-Mirim', 'Campinas'])]

      Nome     Cidade
2   Felipe  São Paulo
6   Jander    Goiânia
7   Marcos    Itapira
8  Oswaldo    Limeira

In [7]:
df.query('Cidade == "Mogi-Mirim" or Nome == "Dayana"')

       Nome      Cidade
0    Dayana  Mogi-Mirim
3    Dayana    Campinas
4    Jander  Mogi-Mirim
9  Gabriela  Mogi-Mirim

In [8]:
# Maneira alternativa
df.query('Cidade == "Mogi-Mirim" | Nome == "Dayana"')

       Nome      Cidade
0    Dayana  Mogi-Mirim
3    Dayana    Campinas
4    Jander  Mogi-Mirim
9  Gabriela  Mogi-Mirim